package com.example.andorid_project.shouye;

import com.example.andorid_project.R;
import com.example.andorid_project.shouye.geci.LrcBean;
import com.example.andorid_project.shouye.geci.PraseLrc;

import java.util.ArrayList;

public class CheshiData {
    public static ArrayList<LrcBean> add(){
        ArrayList<LrcBean> list = new ArrayList<>();
        LrcBean lrcBean1 = new LrcBean(11,"11","11");
        lrcBean1.setBiaoti("你啊我啊风阿");
        lrcBean1.setZhuozhe("李怡然同学");
        lrcBean1.setPic(R.drawable.major_lunbotu1);
        LrcBean lrcBean2 = new LrcBean(11,"11","11");
        lrcBean2.setBiaoti("我期待的不是雪");
        lrcBean2.setZhuozhe("张妙格");
        lrcBean2.setPic(R.drawable.major_lunbotu2);
        String str1="[00:00.0]我啊你啊风啊-李怡然同学\n" +
                "[00:01.61]词：杨郡安\n" +
                "[00:03.22]曲：杨郡安\n" +
                "[00:04.83]编曲：一闻\n" +
                "[00:06.44]制作人：任二三\n" +
                "[00:08.05]和声：马雪涛\n" +
                "[00:09.66]混音/母带：赵卓鹏\n" +
                "[00:11.27]吉他：贰懋\n" +
                "[00:12.88]监制：刘学\n" +
                "[00:14.49]录音室：有乐studio \n" +
                "[00:16.1]封面：胖虎\n" +
                "[00:17.71]出品：每一种声音都值得\n" +
                "[00:19.32]【未经著作权人许可不得翻唱翻录或使用】\n" +
                "[00:20.94]我会慢慢长大\n" +
                "[00:23.04]在日月星辰下\n" +
                "[00:25.17]偶尔和草木说话\n" +
                "[00:29.31]然后乘着风啊\n" +
                "[00:31.35]散落海角天涯\n" +
                "[00:33.63]落入土壤生根发芽\n" +
                "[00:37.68]你要等着我啊\n" +
                "[00:39.9]在荏苒的时光\n" +
                "[00:42.03]尽管岁月几经挣扎\n" +
                "[00:46.11]我会趁着月色\n" +
                "[00:48.27]天空破晓之后\n" +
                "[00:50.49]日落之前抵达\n" +
                "[00:56.73]我啊我啊我啊\n" +
                "[00:58.8]始终还未长大\n" +
                "[01:00.84]像个孩子太多话\n" +
                "[01:05.1]你啊你啊你啊\n" +
                "[01:07.26]阅尽人间繁华\n" +
                "[01:09.39]也该找个地方落下\n" +
                "[01:13.62]风啊风啊风啊\n" +
                "[01:15.69]你总沉默不答\n" +
                "[01:17.7]始终注视着远方\n" +
                "[01:21.18]人生一场\n" +
                "[01:23.31]我们匆匆的来\n" +
                "[01:25.68]也将赤裸着\n" +
                "[01:28.2]匆匆的走啊\n" +
                "[01:47.28]你要等着我啊\n" +
                "[01:49.380005]在荏苒的时光\n" +
                "[01:51.45]尽管岁月几经挣扎\n" +
                "[01:55.619995]我会趁着月色\n" +
                "[01:57.78]天空破晓之后\n" +
                "[01:59.97]日落之前抵达\n" +
                "[02:04.29]我啊我啊我啊\n" +
                "[02:06.15]始终还未长大\n" +
                "[02:08.22]像个孩子太多话\n" +
                "[02:12.54]你啊你啊你啊\n" +
                "[02:14.64]阅尽人间繁华\n" +
                "[02:16.74]也该找个地方落下\n" +
                "[02:21.03]风啊风啊风啊\n" +
                "[02:23.1]你总沉默不答\n" +
                "[02:25.08]始终注视着远方\n" +
                "[02:28.65]人生一场\n" +
                "[02:30.69]我们匆匆的来\n" +
                "[02:33.06]也将赤裸着\n" +
                "[02:35.61]匆匆的走啊\n" +
                "[02:42.0]我啊我啊我啊\n" +
                "[02:44.04001]始终还未长大\n" +
                "[02:46.14]像个孩子太多话\n" +
                "[02:50.37]你啊你啊你啊\n" +
                "[02:52.53]阅尽人间繁华\n" +
                "[02:54.63]也该找个地方落下\n" +
                "[02:58.86]风啊风啊风啊\n" +
                "[03:00.96]你总沉默不答\n" +
                "[03:03.0]始终注视着远方\n" +
                "[03:06.54]人生一场\n" +
                "[03:08.55]我们匆匆的来\n" +
                "[03:10.98]也将赤裸着\n" +
                "[03:13.53]匆匆的走啊\n";
        String str2="[00:00.0]我期待的不是雪-张妙格\n" +
                "[00:00.03]作词：王琛\n" +
                "[00:00.06]作曲：祝子由\n" +
                "[00:00.09]演唱：张妙格\n" +
                "[00:00.12]编曲：果冻\n" +
                "[00:00.15]制作人：王琛\n" +
                "[00:00.18]和音：卿罗\n" +
                "[00:00.21]吉他：小白\n" +
                "[00:00.24]混音：吴泽坤\n" +
                "[00:00.27]配唱：李佩琪@唯迹文化\n" +
                "[00:00.3]封面设计：文森\n" +
                "[00:00.33]商务：米粒\n" +
                "[00:00.36]策划：王琛\n" +
                "[00:00.39]统筹：倪荣涛/李佩琪\n" +
                "[00:00.42]艺人统筹：大米@唯迹文化\n" +
                "[00:00.45]出品：渔樵文化/唯迹文化\n" +
                "[00:00.48]发行：漫吞吞文化\n" +
                "[00:00.51]「未经著作权人许可. 不得翻唱翻录或使用」\n" +
                "[00:00.54]我期待的不是雪\n" +
                "[00:02.46]而是有你的冬天\n" +
                "[00:04.86]我期待的不是月\n" +
                "[00:06.69]而是和你的遇见\n" +
                "[00:09.09]我期待烟花漫天\n" +
                "[00:10.92]我可以永远靠在你左肩\n" +
                "[00:14.1]我期待的不是一句抱歉\n" +
                "[00:18.84]号码 变作未知断了线\n" +
                "[00:23.1]有人 经过后注定失联\n" +
                "[00:27.36]玻璃窗 写着心愿\n" +
                "[00:29.28]美梦挤满房间\n" +
                "[00:30.9]Oh 冬夜的风吹来\n" +
                "[00:32.79]就消失不见\n" +
                "[00:35.88]离别 像天亮不知不觉\n" +
                "[00:40.11]无言 比谎话更像再见\n" +
                "[00:44.34]一个人 坠入冬天\n" +
                "[00:46.29]孤独与我周旋\n" +
                "[00:47.94]Oh 漫天的雪\n" +
                "[00:49.23]不及再看你一眼\n" +
                "[00:51.54]我期待的不是雪\n" +
                "[00:53.46]而是有你的冬天\n" +
                "[00:55.77]我期待的不是月\n" +
                "[00:57.72]而是和你的遇见\n" +
                "[01:00.03]我期待烟花漫天\n" +
                "[01:01.92]我可以 永远靠在你左肩\n" +
                "[01:05.04]我期待的不是一句抱歉\n" +
                "[01:08.49]我期待的不是雪\n" +
                "[01:10.44]而是有你的冬天\n" +
                "[01:12.81]我期待的不是风\n" +
                "[01:14.67]而是归根的落叶\n" +
                "[01:17.04]我期待染白了头\n" +
                "[01:18.9]我和你 相拥走很远很远\n" +
                "[01:22.08]不顾一切的爱永不会变\n" +
                "[01:38.07]你像 白月陪伴我失眠\n" +
                "[01:48.09]我是 你不存在的想念\n" +
                "[01:52.32]一个人 坠入冬天\n" +
                "[01:54.240005]孤独与我周旋\n" +
                "[01:55.8]Oh 漫天的雪\n" +
                "[01:57.21]不及再看你一眼\n" +
                "[01:59.520004]我期待的不是雪\n" +
                "[02:01.44]而是有你的冬天\n" +
                "[02:03.75]我期待的不是月\n" +
                "[02:05.67]而是和你的遇见\n" +
                "[02:08.01]我期待烟花漫天\n" +
                "[02:09.87]我可以 永远靠在你左肩\n" +
                "[02:13.05]我期待的不是一句抱歉\n" +
                "[02:16.47]我期待的不是雪\n" +
                "[02:18.39]而是有你的冬天\n" +
                "[02:20.82]我期待的不是风\n" +
                "[02:22.62]而是归根的落叶\n" +
                "[02:25.02]我期待染白了头\n" +
                "[02:26.85]我和你 相拥走很远很远\n" +
                "[02:30.0]不顾一切的爱永不会变\n";
        lrcBean1.setGeci(str1);
        lrcBean2.setGeci(str2);
        lrcBean1.setLrcBeanList(PraseLrc.jiexi(str1));
        lrcBean2.setLrcBeanList(PraseLrc.jiexi(str2));
        list.add(lrcBean1);
        list.add(lrcBean2);
        return list;
    }
}
